//Напишите программу, которая по заданному номеру четверти показывет диапазон вохможных координат
//точек в этой четверти (X и Y)
Console.WriteLine(int.MaxValue);
Console.WriteLine(int.MinValue);